espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/wiseconnect-wifi-bt-sdk/examples/snippets/bt/bt_a2dp_source_with_avrcp/platforms/nxp/rt595/devices/MIMXRT595S/drivers/fsl_clock.c
        case CLKCTL1_CLKOUTSEL1_SEL(1):
            freq = CLOCK_GetSysPfdFreq(kCLOCK_Pfd0);
            break;

        case CLKCTL1_CLKOUTSEL1_SEL(2):
            freq = CLOCK_GetSysPfdFreq(kCLOCK_Pfd2);
            break;

        case CLKCTL1_CLKOUTSEL1_SEL(3):
            freq = CLOCK_GetSysPfdFreq(kCLOCK_Pfd1);
            break;

        case CLKCTL1_CLKOUTSEL1_SEL(4):
            freq = CLOCK_GetSysPfdFreq(kCLOCK_Pfd3);
            break;

        case CLKCTL1_CLKOUTSEL1_SEL(5):
            freq = CLOCK_GetAudioPllClkFreq();
            break;

        case CLKCTL1_CLKOUTSEL1_SEL(6):
            freq = CLOCK_GetOsc32KFreq();
            break;

        default:
            break;
    }

    return freq / ((CLKCTL1->CLKOUTFCLKDIV & CLKCTL1_CLKOUTFCLKDIV_DIV_MASK) + 1U);
}

/* Get FRG Clk */
/*! brief  Return Input frequency for the Fractional baud rate generator
 *  return Input Frequency for FRG
 */
uint32_t CLOCK_GetFRGClock(uint32_t id)
{
    uint32_t freq                 = 0U;
    uint32_t frgPllDiv            = 1U;
    uint32_t clkSel               = 0U;
    uint32_t frgDiv               = 0U;
    uint32_t frgMul               = 0U;
    volatile uint32_t *pFrgClkSel = &CLKCTL1->FRG0CLKSEL;
    volatile uint32_t *pFrgCtl    = &CLKCTL1->FRG0CTL;

    assert(id <= 17U);

    clkSel = *(pFrgClkSel + 8 * id) & CLKCTL1_FRG0CLKSEL_SEL_MASK;
    frgMul = (*(pFrgCtl + 8 * id) & CLKCTL1_FRG0CTL_MULT_MASK) >> CLKCTL1_FRG0CTL_MULT_SHIFT;
    frgDiv = (*(pFrgCtl + 8 * id) & CLKCTL1_FRG0CTL_DIV_MASK) >> CLKCTL1_FRG0CTL_DIV_SHIFT;

    switch (clkSel)
    {
        case CLKCTL1_FRG0CLKSEL_SEL(0):
            freq = CLOCK_GetMainClkFreq();
            break;

        case CLKCTL1_FRG0CLKSEL_SEL(1):
            frgPllDiv = (CLKCTL1->FRGPLLCLKDIV & CLKCTL1_FRGPLLCLKDIV_DIV_MASK) + 1U;
            freq      = CLOCK_GetSysPfdFreq(kCLOCK_Pfd0) / frgPllDiv;
            break;

        case CLKCTL1_FRG0CLKSEL_SEL(2):
            freq = CLK_FRO_48MHZ;
            break;

        default:
            break;
    }

    return ((uint64_t)freq * (frgDiv + 1)) / (frgMul + frgDiv + 1);
}

/* Get FLEXCOMM Clk */
/*! brief  Return Frequency of Flexcomm functional Clock
 *  param   id    : flexcomm index to get frequency.
 *  return Frequency of Flexcomm functional Clock
 */
uint32_t CLOCK_GetFlexcommClkFreq(uint32_t id)
{
    uint32_t freq   = 0U;
    uint32_t clkSel = 0U;

    assert(id <= 16U);

    clkSel = *(&CLKCTL1->FC0FCLKSEL + 8 * id);

    switch (clkSel & CLKCTL1_FC0FCLKSEL_SEL_MASK)
    {
        case CLKCTL1_FC0FCLKSEL_SEL(0):
            freq = CLK_FRO_48MHZ;
            break;

        case CLKCTL1_FC0FCLKSEL_SEL(1):
            freq = CLOCK_GetAudioPllClkFreq();
            break;

        case CLKCTL1_FC0FCLKSEL_SEL(2):
            freq = g_mclkFreq;
            break;

        case CLKCTL1_FC0FCLKSEL_SEL(3):
            freq = CLOCK_GetFRGClock(id);
            break;

        default:
            break;
    }

    return freq;
}

/*! @brief  Return Frequency of Flexio functional Clock
 *  @return Frequency of Flexcomm functional Clock
 */
uint32_t CLOCK_GetFlexioClkFreq(void)
{
    uint32_t freq = 0U;

    switch (CLKCTL1->FLEXIOCLKSEL & CLKCTL1_FLEXIOCLKSEL_SEL_MASK)
    {
        case CLKCTL1_FLEXIOCLKSEL_SEL(0):
            freq = CLK_FRO_96MHZ;
            break;

        case CLKCTL1_FLEXIOCLKSEL_SEL(1):
            freq = CLOCK_GetAudioPllClkFreq();
            break;

        case CLKCTL1_FLEXIOCLKSEL_SEL(2):
            freq = CLOCK_GetMclkInClkFreq();
            break;

        case CLKCTL1_FLEXIOCLKSEL_SEL(3):
            freq = CLOCK_GetFRGClock(17);
            break;

        default:
            break;
    }

    return freq / ((CLKCTL1->FLEXIOCLKDIV & CLKCTL1_FLEXIOCLKDIV_DIV_MASK) + 1U);
}

/* Get CTIMER Clk */
/*! brief  Return Frequency of Ctimer Clock
 *  param   id    : ctimer index to get frequency.
 *  return Frequency of Ctimer Clock
 */
uint32_t CLOCK_GetCtimerClkFreq(uint32_t id)
{
    uint32_t freq = 0U;

    switch ((CLKCTL1->CT32BITFCLKSEL[id]) & CLKCTL1_CT32BITFCLKSEL_SEL_MASK)
    {
        case CLKCTL1_CT32BITFCLKSEL_SEL(0):
            freq = CLOCK_GetMainClkFreq();
            break;

        case CLKCTL1_CT32BITFCLKSEL_SEL(1):
            freq = CLK_FRO_192MHZ;
            break;

        case CLKCTL1_CT32BITFCLKSEL_SEL(2):
            freq = CLOCK_GetAudioPllClkFreq();
            break;

        case CLKCTL1_CT32BITFCLKSEL_SEL(3):
            freq = CLOCK_GetMclkInClkFreq();
            break;

        case CLKCTL1_CT32BITFCLKSEL_SEL(4):
            freq = CLOCK_GetWakeClk32KFreq();
            break;

        default:
            break;
    }

    return freq;
}

/*! @brief  Return Frequency of FLEXSPI Clock
 *  @param  id : flexspi index to get frequency.
 *  @return Frequency of Flexspi.
 */
uint32_t CLOCK_GetFlexspiClkFreq(uint32_t id)
{
    uint32_t freq = 0U;
    uint32_t clkSel;
    uint32_t clkDiv;

    assert(id <= 1U);

    if (id == 0)
    {
        clkSel = CLKCTL0->FLEXSPI0FCLKSEL & CLKCTL0_FLEXSPI0FCLKSEL_SEL_MASK;
        clkDiv = CLKCTL0->FLEXSPI0FCLKDIV & CLKCTL0_FLEXSPI0FCLKDIV_DIV_MASK;
    }
    else
    {
        clkSel = CLKCTL0->FLEXSPI1FCLKSEL & CLKCTL0_FLEXSPI1FCLKSEL_SEL_MASK;
        clkDiv = CLKCTL0->FLEXSPI1FCLKDIV & CLKCTL0_FLEXSPI1FCLKDIV_DIV_MASK;
    }

    switch (clkSel)
    {
        case CLKCTL0_FLEXSPI0FCLKSEL_SEL(0):
            freq = CLOCK_GetMainClkFreq();
            break;

        case CLKCTL0_FLEXSPI0FCLKSEL_SEL(1):
            freq = CLOCK_GetSysPfdFreq(kCLOCK_Pfd0);
            break;

        case CLKCTL0_FLEXSPI0FCLKSEL_SEL(2):
            freq = CLOCK_GetSysPfdFreq(kCLOCK_Pfd2);
            break;

        case CLKCTL0_FLEXSPI0FCLKSEL_SEL(3):
            freq = CLK_FRO_192MHZ;
            break;

        case CLKCTL0_FLEXSPI0FCLKSEL_SEL(4):
            freq = CLOCK_GetSysPfdFreq(kCLOCK_Pfd3);
            break;

        default:
            break;
    }

    return freq / (clkDiv + 1U);
}

/* Get SCT Clk */
/*! brief  Return Frequency of sct
 *  return Frequency of sct clk
 */
uint32_t CLOCK_GetSctClkFreq(void)
{
    uint32_t freq = 0U;

    switch ((CLKCTL0->SCTFCLKSEL) & CLKCTL0_SCTFCLKSEL_SEL_MASK)
    {
        case CLKCTL0_SCTFCLKSEL_SEL(0):
            freq = CLOCK_GetMainClkFreq();
            break;

        case CLKCTL0_SCTFCLKSEL_SEL(1):
            freq = CLOCK_GetSysPfdFreq(kCLOCK_Pfd0);
            break;

        case CLKCTL0_SCTFCLKSEL_SEL(2):
            freq = CLOCK_GetSysPfdFreq(kCLOCK_Pfd2);
            break;

        case CLKCTL0_SCTFCLKSEL_SEL(3):
            freq = CLK_FRO_192MHZ;
            break;

