espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/wiseconnect-wifi-bt-sdk/examples/snippets/bt/bt_a2dp_source_with_avrcp/platforms/nxp/rt595/devices/MIMXRT595S/drivers/fsl_clock.c
/* Initialize the Audio PLL PFD */
/*! brief Initialize the audio PLL PFD.
 *  param pfd    : Which PFD clock to enable.
 *  param divider    : The PFD divider value.
 *  note It is recommended that PFD settings are kept between 12-35.
 */
void CLOCK_InitAudioPfd(clock_pfd_t pfd, uint8_t divider)
{
    uint32_t pfdIndex = (uint32_t)pfd;
    uint32_t syspfd;

    syspfd = CLKCTL1->AUDIOPLL0PFD &
             ~((CLKCTL1_AUDIOPLL0PFD_PFD0_CLKGATE_MASK | CLKCTL1_AUDIOPLL0PFD_PFD0_MASK) << (8 * pfdIndex));

    /* Disable the clock output first. */
    CLKCTL1->AUDIOPLL0PFD = syspfd | (CLKCTL1_AUDIOPLL0PFD_PFD0_CLKGATE_MASK << (8 * pfdIndex));

    /* Set the new value and enable output. */
    CLKCTL1->AUDIOPLL0PFD = syspfd | (CLKCTL1_AUDIOPLL0PFD_PFD0(divider) << (8 * pfdIndex));
    /* Wait for output becomes stable. */
    while ((CLKCTL1->AUDIOPLL0PFD & (CLKCTL1_AUDIOPLL0PFD_PFD0_CLKRDY_MASK << (8 * pfdIndex))) == 0)
    {
    }
    /* Clear ready status flag. */
    CLKCTL1->AUDIOPLL0PFD |= (CLKCTL1_AUDIOPLL0PFD_PFD0_CLKRDY_MASK << (8 * pfdIndex));
}

/*! @brief  Enable/Disable sys osc clock from external crystal clock.
 *  @param  enable : true to enable system osc clock, false to bypass system osc.
 *  @param  delay_us : Delay time after OSC power up.
 */
void CLOCK_EnableSysOscClk(bool enable, uint32_t delay_us)
{
    if (enable)
    {
        CLKCTL0->SYSOSCCTL0    = CLKCTL0_SYSOSCCTL0_LP_ENABLE_MASK;
        CLKCTL0->SYSOSC_BYPASS = 0;
    }
    else
    {
        CLKCTL0->SYSOSCCTL0 |= CLKCTL0_SYSOSCCTL0_BYPASS_ENABLE_MASK;
    }

    SDK_DelayAtLeastUs(delay_us);
}

/*! @brief  Enable/Disable FRO192M clock output.
 *  @param  divOutEnable : Or'ed value of clock_fro_output_en_t to enable certain clock freq output.
 */
void CLOCK_EnableFroClk(uint32_t divOutEnable)
{
    if (divOutEnable)
    {
        /* Some FRO frequency need to be outputed. Wait FRO stable first in case FRO just get powered on. */
        while ((CLKCTL0->FROCLKSTATUS & CLKCTL0_FROCLKSTATUS_CLK_OK_MASK) == 0)
        {
        }
    }
    else
    {
        /* Do nothing */
    }
    CLKCTL0->FRODIVOEN = divOutEnable & kCLOCK_FroAllOutEn;
}

/*! @brief  Enable LPOSC 1MHz clock.
 */
void CLOCK_EnableLpOscClk(void)
{
    /* No LPOSC enable/disable control in CLKCTL. Just wait LPOSC stable in case LPOSC just get powered on. */
    while ((CLKCTL0->LPOSCCTL0 & CLKCTL0_LPOSCCTL0_CLKRDY_MASK) == 0)
    {
    }
}

void CLOCK_EnableFroTuning(bool enable)
{
    uint32_t xtalFreq   = CLOCK_GetXtalInClkFreq();
    uint64_t targetFreq = CLK_FRO_48MHZ;
    uint32_t expected, up, low;
    uint32_t captured, trim;

    assert(xtalFreq);
    assert(targetFreq > xtalFreq);

    if (enable)
    {
        expected = (uint32_t)((targetFreq * (2047U * 2 + 1) / xtalFreq + 6) / 2);
        up       = (uint32_t)(targetFreq * 2047U * 100085U / xtalFreq / 100000U + 2);
        low      = (uint32_t)((targetFreq * 2048U * 99915U + (uint64_t)xtalFreq * 100000U) / xtalFreq / 100000U + 3);

        /* Start tuning */
        CLKCTL0->FRO_CONTROL = CLKCTL0_FRO_CONTROL_EXP_COUNT(expected) |
                               CLKCTL0_FRO_CONTROL_THRESH_RANGE_UP(up - expected) |
                               CLKCTL0_FRO_CONTROL_THRESH_RANGE_LOW(expected - low) | CLKCTL0_FRO_CONTROL_ENA_TUNE_MASK;

        while (true)
        {
            while ((CLKCTL0->FRO_CAPVAL & CLKCTL0_FRO_CAPVAL_DATA_VALID_MASK) == 0)
            {
            }

            captured = CLKCTL0->FRO_CAPVAL & CLKCTL0_FRO_CAPVAL_CAPVAL_MASK;
            trim     = CLKCTL0->FRO_RDTRIM;
            /* Clear FRO_CAPVAL VALID flag */
            CLKCTL0->FRO_RDTRIM = trim;
            /* Reach the frequency range, then return. */
            if (captured <= up && captured >= low)
            {
                break;
            }
        }
    }
    else
    {
        CLKCTL0->FRO_CONTROL &= ~CLKCTL0_FRO_CONTROL_ENA_TUNE_MASK;
    }
}

/*! @brief Enable USB HS device clock.
 *
 * This function enables USB HS device clock.
 */
void CLOCK_EnableUsbHs0DeviceClock(clock_attach_id_t src, uint8_t divider)
{
    CLOCK_AttachClk(src);
    /* frequency division for usb ip clock */
    CLOCK_SetClkDiv(kCLOCK_DivUsbHsFclk, divider);
    /* Enable usbhs device clock */
    CLOCK_EnableClock(kCLOCK_UsbhsDevice);
}

/*! @brief Disable USB HS device clock.
 *
 * This function disables USB HS device clock.
 */
void CLOCK_DisableUsbHs0DeviceClock(void)
{
    /* Disable usbhs device clock */
    CLOCK_DisableClock(kCLOCK_UsbhsDevice);
}

/*! @brief Enable USB HS host clock.
 *
 * This function enables USB HS host clock.
 */
void CLOCK_EnableUsbHs0HostClock(clock_attach_id_t src, uint8_t divider)
{
    CLOCK_AttachClk(src);
    /* frequency division for usb ip clock */
    CLOCK_SetClkDiv(kCLOCK_DivUsbHsFclk, divider);
    /* Enable usbhs host clock */
    CLOCK_EnableClock(kCLOCK_UsbhsHost);
}

/*! @brief Disable USB HS host clock.
 *
 * This function disables USB HS host clock.
 */
void CLOCK_DisableUsbHs0HostClock(void)
{
    /* Disable usbhs host clock */
    CLOCK_DisableClock(kCLOCK_UsbhsHost);
}

/*! brief Enable USB hs0PhyPll clock.
 *
 * param src  USB HS clock source.
 * param freq The frequency specified by src.
 * retval true The clock is set successfully.
 * retval false The clock source is invalid to get proper USB HS clock.
 */
bool CLOCK_EnableUsbHs0PhyPllClock(clock_attach_id_t src, uint32_t freq)
{
    uint32_t phyPllDiv  = 0U;
    uint16_t multiplier = 0U;
    uint32_t*  clcok_prt;
    uint32_t  clcok_value;
    

    if (((uint32_t)(CLKCTL0->USBHSFCLKSEL & CLKCTL0_USBHSFCLKSEL_SEL_MASK)) != CLKCTL0_USBHSFCLKSEL_SEL(src))
    {
        return false;
    }

    /* enable usb phy clock */
    CLOCK_EnableClock(kCLOCK_UsbhsPhy);
    USBPHY->CTRL_CLR = USBPHY_CTRL_SFTRST_MASK;
    USBPHY->CTRL_CLR = USBPHY_CTRL_CLR_CLKGATE_MASK;
    
    /* switch to fast clock */
    clcok_prt = (uint32_t*)(0x4013B000u + 0x90); 
    clcok_value = *clcok_prt;
    clcok_value &= 0xfffffffe;
    *clcok_prt = clcok_value;
    USBPHY->CTRL_SET = 1<<13; 

    /* This field controls the USB PLL regulator, set to enable the regulator. SW
    must set this bit 15 us before setting PLL_POWER to avoid glitches on PLL
    output clock. */
    USBPHY->PLL_SIC_SET = USBPHY_PLL_SIC_PLL_REG_ENABLE_MASK;
    uint32_t i          = 5000U;
    while (i--)
    {
        __NOP();
    }

    USBPHY->PLL_SIC_SET = USBPHY_PLL_SIC_PLL_POWER(1);
    while (!(USBPHY->PLL_SIC & USBPHY_PLL_SIC_PLL_POWER_MASK))
    {
        USBPHY->PLL_SIC_SET = USBPHY_PLL_SIC_PLL_POWER(1);
    }
    while (!(USBPHY->PLL_SIC & USBPHY_PLL_SIC_PLL_LOCK_MASK))
    {
    }

    if (480000000U % freq)
    {
        return false;
    }
    multiplier = 480000000 / freq;

    switch (multiplier)
    {
        case 13:
        {
            phyPllDiv = USBPHY_PLL_SIC_PLL_DIV_SEL(0U);
            break;
        }
        case 15:
        {
            phyPllDiv = USBPHY_PLL_SIC_PLL_DIV_SEL(1U);
            break;
        }
        case 16:
        {
            phyPllDiv = USBPHY_PLL_SIC_PLL_DIV_SEL(2U);
            break;
        }
        case 20:
        {
            phyPllDiv = USBPHY_PLL_SIC_PLL_DIV_SEL(3U);
            break;
        }
        case 22:
        {
            phyPllDiv = USBPHY_PLL_SIC_PLL_DIV_SEL(4U);
            break;
        }
        case 25:
        {
            phyPllDiv = USBPHY_PLL_SIC_PLL_DIV_SEL(5U);
            break;
        }
        case 30:
        {
            phyPllDiv = USBPHY_PLL_SIC_PLL_DIV_SEL(6U);
            break;
        }
        case 240:
        {
            phyPllDiv = USBPHY_PLL_SIC_PLL_DIV_SEL(7U);
            break;
        }
        default:
        {
            return false;
        }
    }

    USBPHY->PLL_SIC     = (USBPHY->PLL_SIC & ~(USBPHY_PLL_SIC_PLL_DIV_SEL_MASK)) | phyPllDiv;
    USBPHY->PLL_SIC_CLR = USBPHY_PLL_SIC_PLL_BYPASS_MASK;
    while (USBPHY->PLL_SIC & USBPHY_PLL_SIC_PLL_BYPASS_MASK)
    {
        USBPHY->PLL_SIC_CLR = USBPHY_PLL_SIC_PLL_BYPASS_MASK;
    }

    USBPHY->PLL_SIC_SET = USBPHY_PLL_SIC_PLL_ENABLE(1);
    USBPHY->PLL_SIC_SET = USBPHY_PLL_SIC_SET_PLL_EN_USB_CLKS(1);
    while ((USBPHY->PLL_SIC & (USBPHY_PLL_SIC_PLL_ENABLE(1) | USBPHY_PLL_SIC_SET_PLL_EN_USB_CLKS(1))) !=
           (USBPHY_PLL_SIC_PLL_ENABLE(1) | USBPHY_PLL_SIC_SET_PLL_EN_USB_CLKS(1)))
    {
        USBPHY->PLL_SIC_SET = USBPHY_PLL_SIC_PLL_ENABLE(1) | USBPHY_PLL_SIC_SET_PLL_EN_USB_CLKS(1);
    }

    USBPHY->PWD_SET = 0x0;
    return true;
}

